"Today" = "Today";
"Insights" = "Insights";
"Library" = "Library";
"Settings" = "Settings";
"Quick Guide" = "Quick Guide";
"Log Meals" = "Log Meals";
"Adjust Your Goals" = "Adjust Your Goals";
"The Weekly Bank" = "The Weekly Bank";
"Check Insights" = "Check Insights";
"Got it!" = "Got it!";
"Your History" = "Your History";
"Close" = "Close";
"History" = "History";
"Meals" = "Meals";
"No meals logged yet." = "No meals logged yet.";
"Water" = "Water";
"Supplements" = "Supplements";
"Usually at this time..." = "Usually at this time...";
"Log" = "Log";
"Protein" = "Protein";
"Carbs" = "Carbs";
"Fat" = "Fat";
"Calories" = "Calories";
"Target" = "Target";
"Left" = "Left";
"Over" = "Over";

"%lld Day Streak" = "%lld Day Streak";
"Perfect Days!" = "Perfect Days!";
"Smart Insights" = "Smart Insights";
"Based on your last logs, your True Metabolism (TDEE) is approx **%lld kcal** per day." = "Based on your last logs, your True Metabolism (TDEE) is approx **%lld kcal** per day.";
"Weekly Calories" = "Weekly Calories";
"Body Weight" = "Body Weight";
"Log Weight" = "Log Weight";
"Log Body Weight" = "Log Body Weight";
"Weight (e.g. 75.5)" = "Weight (e.g. 75.5)";
"Enter your weight for %@." = "Enter your weight for %@.";
"Log your weight for a few days to see your trend." = "Log your weight for a few days to see your trend.";

"True TDEE: %lld kcal" = "True TDEE: %lld kcal";
"Target adjusted by %lld kcal due to weekly surplus." = "Target adjusted by %lld kcal due to weekly surplus.";
"Target adjusted by %lld kcal due to weekly deficit." = "Target adjusted by %lld kcal due to weekly deficit.";
"Active Energy: +%lld kcal" = "Active Energy: +%lld kcal";

"Data Management" = "Data Management";
"Connect to Apple Health" = "Connect to Apple Health";
"Export Backup (.csv)" = "Export Backup (.csv)";
"Restore from Backup" = "Restore from Backup";
"Apple Health Integration" = "Apple Health Integration";
"Eat Back Workout Calories" = "Eat Back Workout Calories";
"Forgiveness Safety Floor" = "Forgiveness Safety Floor";
"Minimum Calories" = "Minimum Calories";
"Proactive Coach" = "Proactive Coach";
"Enable Daily Coach" = "Enable Daily Coach";
"Help" = "Help";
"Show Quick Guide" = "Show Quick Guide";
"Open Source" = "Open Source";
"View Source Code on GitHub" = "View Source Code on GitHub";

"Search foods and recipes..." = "Search foods and recipes...";
"Search..." = "Search...";
"Scan Barcode" = "Scan Barcode";
"Custom Food" = "Custom Food";
"Recipe" = "Recipe";
"Add" = "Add";
"Cancel" = "Cancel";
"Save" = "Save";
"Done" = "Done";
"Log Meal" = "Log Meal";

"Foods" = "Foods";
"Recipes" = "Recipes";
"All" = "All";
"Drinks" = "Drinks";
"Fruits" = "Fruits";
"Vegetables" = "Vegetables";
"Meat" = "Meat";
"Dairy & Fats" = "Dairy & Fats";
"Fast Food" = "Fast Food";
"Scanned" = "Scanned";
"Looking up product..." = "Looking up product...";
"Food Library" = "Food Library";
"Recipe Library" = "Recipe Library";
"No Foods" = "No Foods";
"Tap '+' to create food, or scan a barcode." = "Tap '+' to create food, or scan a barcode.";
"Delete" = "Delete";
"No Recipes" = "No Recipes";
"Tap '+' to combine foods into a recipe." = "Tap '+' to combine foods into a recipe.";
"Restaurant or Quick Meal" = "Restaurant or Quick Meal";
"Don't know the exact macros? Just estimate the calories. Consistency is more important than perfect accuracy." = "Don't know the exact macros? Just estimate the calories. Consistency is more important than perfect accuracy.";
"e.g. Five Guys Cheeseburger" = "e.g. Five Guys Cheeseburger";
"Estimated Calories" = "Estimated Calories";
"Required" = "Required";
"How much did you eat?" = "How much did you eat?";
"Servings" = "Servings";
"Calculated Nutrition" = "Calculated Nutrition";
"Volume (ml)" = "Volume (ml)";
"Weight (grams)" = "Weight (grams)";
"Create Food" = "Create Food";
"Name" = "Name";
"e.g. Banana" = "e.g. Banana";
"Barcode (Optional)" = "Barcode (Optional)";
"Scanned:" = "Scanned:";
"Tap to scan" = "Tap to scan";
"Nutrition per 100g/ml" = "Nutrition per 100g/ml";
"Create" = "Create";

// Notifications
"notification_reminder_title" = "Time to log your meals! 🍽️";
"notification_reminder_body" = "Don't forget to track your dinner and update your weight. Consistency is key!";

"Use the Library tab below to log foods and recipes." = "Use the Library tab below to log foods and recipes.";
"Tap the target icon anytime to adjust macros and supplements." = "Tap the target icon anytime to adjust macros and supplements.";
"Your daily targets adapt automatically to smooth out calorie spikes." = "Your daily targets adapt automatically to smooth out calorie spikes.";
"Use the Insights tab to see your weight, streak, and metabolism." = "Use the Insights tab to see your weight, streak, and metabolism.";

// Ultimate Features
"Calculating perfect combo..." = "Calculating perfect combo...";
"Couldn't find an exact match in your library." = "Couldn't find an exact match in your library.";
"Try adding more diverse foods (pure protein, pure carbs, pure fats) to your library so the algorithm can combine them!" = "Try adding more diverse foods (pure protein, pure carbs, pure fats) to your library so the algorithm can combine them!";
"To hit your remaining macros perfectly, eat this:" = "To hit your remaining macros perfectly, eat this:";
"Log This Combo" = "Log This Combo";
"Refresh Suggestion" = "Refresh Suggestion";
"Macro Tetris 🧩" = "Macro Tetris 🧩";
"Fasting Mode Active" = "Fasting Mode Active";
"Time Since Last Meal" = "Time Since Last Meal";
"Social Day / Guilt-Free Mode" = "Social Day / Guilt-Free Mode";
"Mark this day as a social event. Overeating won't show red warnings, but the calories will still be balanced across the week." = "Mark this day as a social event. Overeating won't show red warnings, but the calories will still be balanced across the week.";
"Enable Social Day" = "Enable Social Day";
"New: Lock Screen Widgets! 📱" = "New: Lock Screen Widgets! 📱";
"Track your calories and macros without opening the app. Long-press your home screen or lock screen to add the OffFat widget." = "Track your calories and macros without opening the app. Long-press your home screen or lock screen to add the OffFat widget.";

// Onboarding
"Lose Weight" = "Lose Weight";
"Maintain" = "Maintain";
"Build Muscle" = "Build Muscle";
"Couch / Office Job" = "Couch / Office Job";
"Light (1-2x Sport/Wk)" = "Light (1-2x Sport/Wk)";
"Active (3-5x Sport/Wk)" = "Active (3-5x Sport/Wk)";
"Athlete (Daily Hard Training)" = "Athlete (Daily Hard Training)";
"Welcome to\nOffFat" = "Welcome to\nOffFat";
"100% Offline & Private" = "100% Offline & Private";
"Your data never leaves this device." = "Your data never leaves this device.";
"Weekly Bank" = "Weekly Bank";
"Balances your daily surplus or deficit over time." = "Balances your daily surplus or deficit over time.";
"Quick Logging" = "Quick Logging";
"Easily add meals and track your daily macros." = "Easily add meals and track your daily macros.";
"Calorie Adaptation" = "Calorie Adaptation";
"Helps you understand your metabolism over time." = "Helps you understand your metabolism over time.";
"Let's Build Your Profile" = "Let's Build Your Profile";
"About You" = "About You";
"We use these values to calculate base energy usage." = "We use these values to calculate base energy usage.";
"Male" = "Male";
"Female" = "Female";
"Age (Years)" = "Age (Years)";
"Height (cm)" = "Height (cm)";
"Current Weight (kg)" = "Current Weight (kg)";
"Continue" = "Continue";
"Your Goals" = "Your Goals";
"Tell us what you want to achieve." = "Tell us what you want to achieve.";
"Primary Goal" = "Primary Goal";
"Activity Level" = "Activity Level";
"Calculate My Macros" = "Calculate My Macros";
"Your Recommended Plan" = "Your Recommended Plan";
"These targets serve as an initial estimate, and adapt to your log updates." = "These targets serve as an initial estimate, and adapt to your log updates.";
"Daily Calories (kcal)" = "Daily Calories (kcal)";
"Protein" = "Protein";
"Carbs" = "Carbs";
"Fats" = "Fats";
"Start Tracking" = "Start Tracking";

// Categories
"All" = "All";
"Drinks" = "Drinks";
"Fruits" = "Fruits";
"Vegetables" = "Vegetables";
"Meat" = "Meat";
"Dairy & Fats" = "Dairy & Fats";
"Fast Food" = "Fast Food";
"Other" = "Other";

// Settings
"Data Management" = "Data Management";
"Because OffFat is 100% offline, use these buttons to backup your data or move it to a new iPhone." = "Because OffFat is 100% offline, use these buttons to backup your data or move it to a new iPhone.";
"Connect to Apple Health" = "Connect to Apple Health";
"Export Backup (.csv)" = "Export Backup (.csv)";
"Restore from Backup" = "Restore from Backup";
"Forgiveness Safety Floor" = "Forgiveness Safety Floor";
"The Weekly Bank will never drop your daily target below this minimum calorie limit, even after a large surplus." = "The Weekly Bank will never drop your daily target below this minimum calorie limit, even after a large surplus.";
"Minimum Calories" = "Minimum Calories";
"Proactive Coach" = "Proactive Coach";
"Receive offline daily reminders to take your supplements and hit your protein goals." = "Receive offline daily reminders to take your supplements and hit your protein goals.";
"Enable Daily Coach" = "Enable Daily Coach";
"Help" = "Help";
"Show Quick Guide" = "Show Quick Guide";
"Open Source" = "Open Source";
"OffFat is 100% free and open source. Check out the code or contribute on GitHub." = "OffFat is 100% free and open source. Check out the code or contribute on GitHub.";
"View Source Code on GitHub" = "View Source Code on GitHub";
